<a href="https://colab.research.google.com/github/HerniHartati01/Machine_Learning/blob/main/UTS_Herni_Hartati_Nmr1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
import numpy as np
path="/content/drive/My Drive/machine learning/dataset/catatanlokasi.csv"
dat=pd.read_csv(path)
dat

       id   tanggal          lokasi_dominan
0       1  21/05/19           Jakarta Pusat
1       2  21/05/19         Kabupaten Bogor
2       3  21/05/19           Jakarta Pusat
3       4  21/05/19          Kota Tangerang
4       5  21/05/19              Kota Bogor
...   ...       ...                     ...
2595   96  15/06/19              Kota Bogor
2596   97  15/06/19  Kota Tangerang Selatan
2597   98  15/06/19           Jakarta Timur
2598   99  15/06/19           Jakarta Timur
2599  100  15/06/19           Jakarta Timur

[2600 rows x 3 columns]

In [7]:
dat.dtypes

id                 int64
tanggal           object
lokasi_dominan    object
dtype: object

In [8]:
dat.shape

(2600, 3)

In [9]:
dat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2600 entries, 0 to 2599
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              2600 non-null   int64
 1   tanggal         2600 non-null   object
 2   lokasi_dominan  2600 non-null   object
dtypes: int64(1), object(2)
memory usage: 61.1+ KB

In [10]:
x=dat[['id','tanggal']]
y=dat['lokasi_dominan']

In [11]:
x

       id   tanggal
0       1  21/05/19
1       2  21/05/19
2       3  21/05/19
3       4  21/05/19
4       5  21/05/19
...   ...       ...
2595   96  15/06/19
2596   97  15/06/19
2597   98  15/06/19
2598   99  15/06/19
2599  100  15/06/19

[2600 rows x 2 columns]

In [12]:
y

0                Jakarta Pusat
1              Kabupaten Bogor
2                Jakarta Pusat
3               Kota Tangerang
4                   Kota Bogor
                 ...
2595                Kota Bogor
2596    Kota Tangerang Selatan
2597             Jakarta Timur
2598             Jakarta Timur
2599             Jakarta Timur
Name: lokasi_dominan, Length: 2600, dtype: object

In [13]:
from sklearn.model_selection import train_test_split

In [14]:
x_train, x_test, y_train, y_test=train_test_split(x,y,test_size=0.3)

In [15]:
x_train

      id   tanggal
100    1  22/05/19
2369  70  13/06/19
1719  20  07/06/19
29    30  21/05/19
846   47  29/05/19
...   ..       ...
2346  47  13/06/19
1438  39  04/06/19
162   63  22/05/19
2178  79  11/06/19
2358  59  13/06/19

[1820 rows x 2 columns]

In [16]:
x_test

      id   tanggal
2327  28  13/06/19
1722  23  07/06/19
592   93  26/05/19
2436  37  14/06/19
1025  26  31/05/19
...   ..       ...
259   60  23/05/19
662   63  27/05/19
1626  27  06/06/19
101    2  22/05/19
1214  15  02/06/19

[780 rows x 2 columns]

In [17]:
y_train

100                 Jakarta Pusat
2369                Jakarta Barat
1719    Kabupaten Lampung Selatan
29                     Kota Depok
846                 Jakarta Utara
                  ...
2346                  Kota Bekasi
1438                Kota Semarang
162               Kabupaten Bogor
2178                  Kota Bekasi
2358              Kabupaten Bogor
Name: lokasi_dominan, Length: 1820, dtype: object

In [18]:
y_test

2327        Kota Tangerang
1722    Kabupaten Wonogiri
592             Kota Depok
2436            Kota Depok
1025      Kabupaten Sleman
               ...
259          Jakarta Pusat
662          Jakarta Barat
1626           Kota Padang
101        Kabupaten Bogor
1214          Kota Bandung
Name: lokasi_dominan, Length: 780, dtype: object

In [19]:
len(x_train)

1820

In [20]:
len(x_test)

780

In [21]:
len(y_train)

1820

In [22]:
len(y_test)

780

In [23]:
x_train, x_test, y_train, y_test=train_test_split(x,y,test_size=0.2)

In [24]:
x_train

      id   tanggal
318   19  24/05/19
1879  80  08/06/19
111   12  22/05/19
19    20  21/05/19
169   70  22/05/19
...   ..       ...
2408   9  14/06/19
355   56  24/05/19
806    7  29/05/19
2431  32  14/06/19
1826  27  08/06/19

[2080 rows x 2 columns]

In [25]:
x_test

      id   tanggal
397   98  24/05/19
16    17  21/05/19
92    93  21/05/19
1143  44  01/06/19
2533  34  15/06/19
...   ..       ...
1610  11  06/06/19
1553  54  05/06/19
2449  50  14/06/19
2339  40  13/06/19
118   19  22/05/19

[520 rows x 2 columns]

In [26]:
y_train

318     Kabupaten Tangerang
1879    Kabupaten Tangerang
111          Kota Tangerang
19               Kota Bogor
169         Jakarta Selatan
               ...
2408             Kota Bogor
355         Kabupaten Bogor
806              Kota Depok
2431            Kota Bekasi
1826            Kota Padang
Name: lokasi_dominan, Length: 2080, dtype: object

In [27]:
y_test

397                 Jakarta Timur
16                 Kota Tangerang
92                  Jakarta Barat
1143             Kabupaten Sleman
2533             Kabupaten Bekasi
                  ...
1610             Kabupaten Sleman
1553    Kabupaten Lampung Selatan
2449                Jakarta Barat
2339              Kabupaten Bogor
118           Kabupaten Tangerang
Name: lokasi_dominan, Length: 520, dtype: object

In [28]:
len(x_train)

2080

In [29]:
len(x_test)

520

In [30]:
len(y_train)

2080

In [31]:
len(y_test)

520